app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "gabriela.brasil@aiesec.net"]]
---
  def create(email = params[:my_email], senha = params[:my_password])

        session[:token]= expa_authentication(email,senha)
        if session[:token]== nil
          flash[:warning] = "E-mail ou senha inválida"
          return redirect_to  "/authentication/login"
        else
          #session[:token] = cj.jar['experience.aiesec.org']['/']["expa_token"].value[44,64] #Take the token code for API. First version
          #request the expa's current user data
          @request = "https://gis-api.aiesec.org:443/v1/current_person.json?access_token=#{session[:token]}"
          resp = Net::HTTP.get_response(URI.parse(@request))
          data = resp.body
          @current_person = JSON.parse(data)
          #Check if the member is affiliated to AIESEC Brazil
          if  @current_person['person']['home_mc']['id'] != 1606
              flash[:warning] = "BAZICON is only available for AIESEC in Brazil members"
              return redirect_to  "/authentication/login"
          end
          #Find the user on system
          @user = User.find_by_email(params[:my_email])

INSERT INTO "users" ("name", "email", "photo_url", "postion", "local_commitment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
            @user.photo_url = @current_person['person']["profile_photo_url"]
            @user.postion = @current_person['current_position']['team']['team_type']
            @user.local_commitment = @current_person['person']['home_lc']['id']
            @user.save